/*  Имеется строка "иВан" , нужно обработать эту строку и получить правильное написание в виде "Иван"*/ 

//let string= "иВан";
//console.log(string.replace("иВан", "Иван"));
//console.log(string.slice(0,1).toUpperCase()+string.slice(1,4).toLowerCase());
//console.log(string.slice(0,1).toUpperCase()+string.slice(1,string.length).toLowerCase());




/*  2. Есть стоимость в виде строки "$120". Сначала идёт знак валюты, а затем – число. 
Необходимо извлечь стоимость без знака $ т.е. 
из строки "$120" нужно получить "120"*/ 

let cost="$120";
//console.log(cost.replace("$120", "120"));
console.log(cost.slice(1));


/*   3. Напишите программу, которая осуществляла бы такой диалог человека с компьютером:
    
    **КОМПЬЮТЕР ВЫВОДИТ НА ЭКРАН:** Здравствуй, я компьютер, а тебя как зовут?
    
    ***ЧЕЛОВЕК ВВОДИТ С КЛАВИАТУРЫ:**  Коля*
    
    **КОМПЬЮТЕР ВЫВОДИТ НА ЭКРАН:**  Очень приятно, Коля. Сколько тебе лет?
    
    ***ЧЕЛОВЕК ВВОДИТ С КЛАВИАТУРЫ:**  16*
    
    **КОМПЬЮТЕР ВЫВОДИТ НА ЭКРАН:**   Ого! Тебе уже 16!*/ 


   /* let userName= prompt("Здравствуй, я компьютер, а тебя как зовут?");
    document.write("Очень приятно,"+userName+"<br>");
  let age= prompt(`Очень приятно, ${userName}. Сколько тебе лет?`);
  let surprise=age;
  document.write(` Ого! Тебе уже ${age}!`);*/


  /*Составить скрипт, который запрашивает у пользователя ввести номер кредитной карты.
   Скрипт должен обработать полученный номер и показать на странице последние 4 цифры карты.
   Пример: "Номер вашей карты: **********1245" */
     

   let userCardnum= prompt("Ввести номер кредитной карты");
  //let num=("*".repeat(userCardnum.length()));
  //document.write(`${userCardnum.slice(12,16)}`);
  document.write(`"<h1>Номер вашей карты: ${"*".repeat(userCardnum.length-4)+userCardnum.slice(userCardnum.length-4,userCardnum.length)}`);


